Autodesk.DesignScript.Interfaces.TessellationParameters.Tolerance
The tolerance for faceting.
Default is -1.

Autodesk.DesignScript.Interfaces.TessellationParameters.MaxTessellationDivisions
The maximum number of divisions for tessellation.
Default is 512

Autodesk.DesignScript.Interfaces.TessellationParameters.ShowEdges
A flag indicating whether surface edges should be
included in the RenderPackage. Default is false.

Autodesk.DesignScript.Interfaces.TessellationParameters.UseRenderInstancing
A flag indicating whether rendering data for instancing
is included in the RenderPackage. Default is false.

Autodesk.DesignScript.Interfaces.TessellationParameters.ScaleFactor
The scale factor set in the workspace that must be applied to
distance and coordinate values used in rendering only ASM geometry.
This scale factor is consumed only by LibG in its Tessellate method implementation.