DynamoServices.TraceUtils
Utility class to Get/Set TraceData

DynamoServices.TraceUtils.TEMP_GetTraceKeys
Returns a list of the keys bound to trace elements
This should be extracted from the attribute on the methods
Returns:

DynamoServices.TraceUtils.ClearTLSKey(System.String)
Clear a specific key
key:

DynamoServices.TraceUtils.ClearAllKnownTLSKeys
Clear the named slots for all the know keys

DynamoServices.TraceUtils.GetTraceData(System.String)
Returns the data that is bound to a particular key
key:
Returns:

DynamoServices.TraceUtils.SetTraceData(System.String,System.String)
Set the data bound to a particular key
key:
value: