Autodesk.DesignScript.Runtime.IsObsoleteAttribute
This attribute indicates the node is obsolete

Autodesk.DesignScript.Runtime.IsObsoleteAttribute.#ctor(System.String,System.Type)
Attribute constructor which enables localized message lookup.
descriptionResourceID: resx id for this resource
resourceType: type that contains resource strings.
Throws System.ArgumentNullException:

Autodesk.DesignScript.Runtime.IsObsoleteAttribute.#ctor(System.String,System.String)
Attribute constructor which enables localized message lookup.
descriptionResourceID: resx id for this resource
typeName: name of type that contains resource strings.
!!!Please note that in some .net contexts you must use the fully assembly qualified type name
including version,culture info etc. In others only the type, assembly name are required.
System.Type.AssemblyQualifiedName
Throws System.ArgumentNullException: