Autodesk.DesignScript.Runtime.KeepReferenceThisAttribute
This attribute is applied to member function of zero touch libary.
It indicates the return object should keep a reference to "this"
object so that even "this" object is out of scope, it will not be
disposed.
Note the type of return object should be reference type, either a
pointer or an array.