Autodesk.DesignScript.Interfaces.ITransformable
An interface that defines items which have a transform property, which is a 4x4 matrix.

Autodesk.DesignScript.Interfaces.ITransformable.RequiresCustomTransform
A flag indicating whether the render package has had its Transform property set
explicitly.

Autodesk.DesignScript.Interfaces.ITransformable.Transform
A 4x4 matrix that is used to transform all geometry in the render packaage.

Autodesk.DesignScript.Interfaces.ITransformable.SetTransform(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Set the transform using a series of doubles. The resulting transform is applied to all geometry in the renderPackage.
Following conventional matrix notation, m11 is the value of the first row and first column, and m12
is the value of the first row and second column.
NOTE: This method should set the matrix exactly as described by the caller.
m11:
m12:
m13:
m14:
m21:
m22:
m23:
m24:
m31:
m32:
m33:
m34:
m41:
m42:
m43:
m44:

Autodesk.DesignScript.Interfaces.ITransformable.SetTransform(System.Double[])
Set the transform as a double array, this transform is applied to all geometry in the renderPackage.
This matrix should be laid out as follows in row vector order:
[Xx,Xy,Xz, 0,
Yx, Yy, Yz, 0,
Zx, Zy, Zz, 0,
offsetX, offsetY, offsetZ, W]
NOTE: This method should transform the matrix from row vector order to whatever form is needed by the implementation.
When converting from ProtoGeometry CoordinateSystem form to input matrix, set the first row to the X axis of the CS,
the second row to the Y axis of the CS, the third row to the Z axis of the CS, and the last row to the CS origin, where W = 1.
matrix: