Autodesk.DesignScript.Interfaces.IGraphicDataProvider
This interface provides graphics data into the RenderPackage interface
for given set of objects.

Autodesk.DesignScript.Interfaces.IGraphicDataProvider.GetGraphicItems(System.Object)
Returns a list of IGraphicItem owned by the given object.
obj: The object for which graphics items are queried.
Returns: List of IGraphicItem owned by the input object.

Autodesk.DesignScript.Interfaces.IGraphicDataProvider.Tessellate(System.Collections.Generic.List{System.Object},Autodesk.DesignScript.Interfaces.IRenderPackage,Autodesk.DesignScript.Interfaces.TessellationParameters)
Returns the Graphics/Render data into the given render package.
objects: Objects which owns some graphics items
package: RenderPackage where graphics/render data can
be pushed/set.
parameters: A TessellationParameters object.