Dynamo.Logging.Actions
Actions for analytics tracking.

Dynamo.Logging.Actions.Start
Start of an event

Dynamo.Logging.Actions.End
End of an event

Dynamo.Logging.Actions.Create
Create Event, such as File create or Node create etc.

Dynamo.Logging.Actions.Delete
Delete Event, such as Node delete

Dynamo.Logging.Actions.Move
Move Event, such as Node move, dialog move

Dynamo.Logging.Actions.Copy
Copy Event, such as Node copy

Dynamo.Logging.Actions.Open
Open Event, such as Open workspace

Dynamo.Logging.Actions.Close
Close Event, such as Close workspace, Close Python Editor

Dynamo.Logging.Actions.Read
Read Event, such as File read

Dynamo.Logging.Actions.Write
Write Event, such as File write

Dynamo.Logging.Actions.Save
Save Event, such as Save workspace and save Python code

Dynamo.Logging.Actions.SaveAs
SaveAs Event, such as Save workspace as.

Dynamo.Logging.Actions.New
New Event, such as New workspace

Dynamo.Logging.Actions.EngineFailure
Engine Failure event

Dynamo.Logging.Actions.Filter
Filter event, e.g. when package filter is active

Dynamo.Logging.Actions.Unresolved
Unresolved Node found event

Dynamo.Logging.Actions.Downloaded
Update Downloaded event

Dynamo.Logging.Actions.Installed
Update Installed event

Dynamo.Logging.Actions.Select
Select event, such as node auto-complete suggestion selection or in-canvas search selection

Dynamo.Logging.Actions.Migration
Migration event, such as Python migration or DYN migration

Dynamo.Logging.Actions.Switch
Switch event, such as Python engine switch, dropdown node switch

Dynamo.Logging.Actions.Run
Run event, such as Python node run clicked, Graph run Clicked, generic node run during graph execution

Dynamo.Logging.Actions.Load
Load event, such as extensions loaded, package loaded

Dynamo.Logging.Actions.Dock
Dock event, such as docking view extension

Dynamo.Logging.Actions.Undock
Undock event, such as undocking view extension

Dynamo.Logging.Actions.Rate
Rate event, such as rating guided tour

Dynamo.Logging.Actions.Pin
Pin event, such as pinning a note to a node

Dynamo.Logging.Actions.Unpin
Unpin event, such as unpinning a note from a node

Dynamo.Logging.Actions.DownloadNew
Download new event, such as downloading a new package in package reference section by user

Dynamo.Logging.Actions.KeepOld
KeepOld event, e.g. choosing to keep the old package in package reference section by user

Dynamo.Logging.Actions.PackageReferences
PackageReferences event, when a package reference is saved in a workspace

Dynamo.Logging.Actions.LocalReferences
KeepOldPackage event, when a local reference is saved in a workspace

Dynamo.Logging.Actions.ExternalReferences
KeepOldPackage event, when an external reference is saved in a workspace

Dynamo.Logging.Actions.Ungroup
Ungroup event, when an group is Ungrouped

Dynamo.Logging.Actions.Expanded
Expand event, when an group is Expanded

Dynamo.Logging.Actions.Collapsed
Collapse event, when an group is Collapsed

Dynamo.Logging.Actions.AddedTo
AddedTo event, when a node is added to the group

Dynamo.Logging.Actions.RemovedFrom
RemovedFrom event, when a node is removed from the group

Dynamo.Logging.Actions.Preview
Preview event, when a node is Previewed

Dynamo.Logging.Actions.Freeze
Freeze event, when a node is Freezed

Dynamo.Logging.Actions.Rename
Rename event, when a node is Renamed

Dynamo.Logging.Actions.Show
Show event, when user wants to toggle display.

Dynamo.Logging.Actions.Set
Set event, when user wants to set a property.

Dynamo.Logging.Actions.Dismiss
Dismiss event, e.g. to dismiss node alerts.

Dynamo.Logging.Actions.Undismiss
Undismiss event, to show dismissed alerts.

Dynamo.Logging.Actions.Break
Break event, e.g. when a connection is broken by user choice

Dynamo.Logging.Actions.Hide
Hide event, e.g when a connection is hidden by user choice

Dynamo.Logging.Actions.BuiltInPackageConflict
When a package conflict is encountered which involves at least one built-in package.

Dynamo.Logging.Actions.Sort
Sort event, when user wants to sort some information

Dynamo.Logging.Actions.View
View event, when user wants to see some information

Dynamo.Logging.Actions.ViewDocumentation
Show event, when user wants to view Documentation.

Dynamo.Logging.Actions.Cancel
Cancel operation, e.g. cancel adding a new group style

Dynamo.Logging.Actions.Completed
Completed event, e.g. when a user completes a guided tour

Dynamo.Logging.Actions.Next
Next event, e.g. when a user clicks next on a guided tour

Dynamo.Logging.Actions.Previous
Previous event, e.g. when a user goes back on a guided tour

Dynamo.Logging.Actions.TimeElapsed
TimeElapsed event, e.g. tracks the time elapsed since an event

Dynamo.Logging.Actions.SignIn
SignIn event, e.g. tracks the SignIn event

Dynamo.Logging.Actions.SignOut
SignOut event, e.g. tracks the SignOut event

Dynamo.Logging.Actions.Import
Import event, e.g. tracks the ImportSettings event

Dynamo.Logging.Actions.Export
Export event, e.g. tracks the ExportSettings event