Dynamo.Logging.Categories
Categories for analytics tracking.

Dynamo.Logging.Categories.ApplicationLifecycle
Events Category related to application lifecycle

Dynamo.Logging.Categories.Stability
Events Category related to product stability

Dynamo.Logging.Categories.NodeOperations
Events Category related to Node operations

Dynamo.Logging.Categories.Performance
Events Category related to Performance

Dynamo.Logging.Categories.Command
Events Category related to Dynamo commands

Dynamo.Logging.Categories.FileOperation
Events Category related to File operations

Dynamo.Logging.Categories.SearchUX
Events Category related to Search UX

Dynamo.Logging.Categories.Preferences
Events Category related to user preferences

Dynamo.Logging.Categories.PackageManager
Events Category related to the Package Manager

Dynamo.Logging.Categories.Upgrade
Events Category related to Dynamo upgrade

Dynamo.Logging.Categories.Engine
Events Category related to DesignScript VM

Dynamo.Logging.Categories.NodeAutoCompleteOperations
Events Category related to Node Auto-Complete

Dynamo.Logging.Categories.InCanvasSearchOperations
Events Category related to In-Canvas search

Dynamo.Logging.Categories.PythonOperations
Events Category related to Python operations

Dynamo.Logging.Categories.ExtensionOperations
Events Category related to Extensions operations

Dynamo.Logging.Categories.ViewExtensionOperations
Events Category related to View Extensions operations

Dynamo.Logging.Categories.PackageManagerOperations
Events Category related to package manager operations

Dynamo.Logging.Categories.NoteOperations
Events Category related to Note operations

Dynamo.Logging.Categories.WorkspaceReferencesOperations
Events Category related to Workspace References Operations

Dynamo.Logging.Categories.WorkspaceReferences
Events Category related to saved Workspace References

Dynamo.Logging.Categories.GroupOperations
Events Category related to Groups

Dynamo.Logging.Categories.NodeContextMenuOperations
Events Category related to Node context menu

Dynamo.Logging.Categories.ConnectorOperations
Events Category related to connectors

Dynamo.Logging.Categories.GroupStyleOperations
Events Category related to group styles

Dynamo.Logging.Categories.GuidedTourOperations
Events Category related to guided tours

Dynamo.Logging.Categories.SplashScreenOperations
Events Category related to the splash screen

Dynamo.Logging.Categories.DynamoMLDataPipelineOperations
Events Category related to DynamoMLDataPipeline