Autodesk.DesignScript.Runtime.AllowRankReductionAttribute
This attribute can be applied to methods that return collection of
objects, but with some combination of input parameters it returns a
collection of single object and at designscript side we want the method
to return a single object instead of a collection of single object.

Autodesk.DesignScript.Runtime.AllowRankReductionAttribute.ReduceRank(System.Object)
Utility method to get the single object from the collection of
single object. If the input object is neither a collection nor a
collection of single object, this method returns the input object.
collection: Input object to be converted to singleton.
Returns: An object from the collection of single object or the
input object.

Autodesk.DesignScript.Runtime.AllowRankReductionAttribute.IsRankReducible(System.Object)
Checks if the input object is a collection of single object.
collection:
Returns: