Dynamo.PythonServices.PythonCodeCompletionProviderCommon
This class represents a base class for Python code completion providers
It partially implements the IExternalCodeCompletionProviderCore interface and
contains a collection of utility functions/properties that are common among existing code completion provider classes

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.knownAssemblies
A list of short assembly names used with the TryGetTypeFromFullName method

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.BasicVariableTypes
Maps a basic variable regex to a basic python type.

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.ClrModules
Tracks already referenced CLR modules

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.BadStatements
Keeps track of failed statements to avoid poluting the log

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.GetDescription(System.String,System.String,System.Boolean)
Try to generate a description from a typename.
stub: Everything before the last namespace or type name e.g. System.Collections in System.Collections.ArrayList
item: Everything after the stub
isInstance: Whether it's an instance or not

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.EnumerateMembers(System.Type,System.String)
List all of the members in a CLR type
type: The type
name: The name for the type
Returns: A list of completion data for the type

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.GetLastName(System.String)
Returns the last name from the input line. The regex ignores tabs, spaces, the first new line, etc.
text:
Returns:

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.GetLastNameSpace(System.String)
Returns the entire namespace from the end of the input line. The regex ignores tabs, spaces, the first new line, etc.
text:
Returns:

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.GetFirstPossibleTypeName(System.String)
Returns the first possible type name from the type's declaration line.
line:
Returns:

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.StripDocStrings(System.String)
Removes any docstring characters from the source code
code:
Returns:

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.FindClrReferences(System.String)
Detect all library references given the provided code
code: Script code to search for CLR references
Returns:

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.TryGetTypeFromFullName(System.String)
Check if a full type name is found in one of the known pre-loaded assemblies and return the type
name: a full type name
Returns:

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.UpdateImportedTypes(System.String)
Find all import statements and import into scope.  If the type is already in the scope, this will be skipped.
code: The code to discover the import statements.

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.UpdateVariableTypes(System.String)
Traverse the given source code and define variable types based on
the current scope
code: The source code to look through

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.FindAllVariableAssignments(System.String)
Attempts to find all variable assignments in the code. Has basic variable unpacking support.
We don't need to check the line indices because regex matches are ordered as per the code.
code: The code to search
Returns: A dictionary of variable name and type pairs

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.TryGetType(System.String)
Retrieves the clr Type corresponding to the input paramater name
name:
Returns:

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.FindAllTypeImportStatements(System.String)
Attempts to find import statements that look like
from lib import *
code: The code to search
Returns: A dictionary matching the lib to the code where lib is the library being imported from

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.FindTypeSpecificImportStatements(System.String)
Attempts to find import statements that look like
from lib import type1, type2
Doesn't currently match types with namespace qualifiers like Collections.ArrayList
code: The code to search
Returns: A dictionary matching the lib to the code where lib is the library being imported from

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.FindVariableStatementWithRegex(System.String,System.String)
Find a variable assignment of the form "varName = bla" where bla is matched by
the given regex
code: The code to search
valueRegex: Your regex to match the type
Returns: A dictionary of name to assignment line pairs

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.FindAllImportStatements(System.String)
Attempts to find all import statements in the code
code: The code to search
Returns: A list of tuples that contain the namespace, the module, and the custom name

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.FindAllVariables(System.String)
Find a variable assignment of the form "varName = bla" where bla is matched by
the given regex
code: The code to search
Returns: A dictionary of name to assignment line pairs

Dynamo.PythonServices.PythonCodeCompletionProviderCommon.FindBasicImportStatements(System.String)
Attempts to find import statements that look like
import lib
code: The code to search
Returns: A dictionary matching the lib to the code where lib is the library being imported from