Autodesk.DesignScript.Interfaces.IRenderPackage
This interface caches render specific data.

Autodesk.DesignScript.Interfaces.IRenderPackage.Description
A tag used to store information about the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.IsSelected
A flag indicating whether the render package is selected.

Autodesk.DesignScript.Interfaces.IRenderPackage.HasRenderingData
A flag indicating whether the render package has data.

Autodesk.DesignScript.Interfaces.IRenderPackage.DisplayLabels
A flag indicating whether the render package is displaying labels

Autodesk.DesignScript.Interfaces.IRenderPackage.RequiresPerVertexColoration
A flag indicating whether the render package requires
per vertex coloration.

Autodesk.DesignScript.Interfaces.IRenderPackage.PointVertexCount
The number of point vertices in the package.

Autodesk.DesignScript.Interfaces.IRenderPackage.LineVertexCount
The number of line vertices in the package.

Autodesk.DesignScript.Interfaces.IRenderPackage.MeshVertexCount
The number of mesh vertices in the package.

Autodesk.DesignScript.Interfaces.IRenderPackage.LineStripVertexCounts
A collection of int values representing how many vertices
comprise each line segment in the package.

Autodesk.DesignScript.Interfaces.IRenderPackage.LineStripVertices
A collection containing all line strip vertices as x1,y1,z1,x2,y2,z2...

Autodesk.DesignScript.Interfaces.IRenderPackage.LineStripVertexColors
A collection containing all line strip colors as r1,g1,b1,a1,r2,g2,b2,a2...

Autodesk.DesignScript.Interfaces.IRenderPackage.LineStripIndices
A collection containing all line strip indices.

Autodesk.DesignScript.Interfaces.IRenderPackage.MeshVertices
A collection containing all mesh vertices as x1,y1,z1,x2,y2,z2...

Autodesk.DesignScript.Interfaces.IRenderPackage.MeshVertexColors
A collection containing all mesh vertex colors as r1,g1,b1,a1,r2,g2,b2,a2...

Autodesk.DesignScript.Interfaces.IRenderPackage.MeshIndices
A collection containing all mesh vertex indices.

Autodesk.DesignScript.Interfaces.IRenderPackage.MeshNormals
A collection containing all mesh normals as x1,y1,z1,x2,y2,z2...

Autodesk.DesignScript.Interfaces.IRenderPackage.MeshTextureCoordinates
A collection containing all mesh texture coordinates as u1,v1,u2,v2...

Autodesk.DesignScript.Interfaces.IRenderPackage.PointVertices
A collection containing all point vertices as x1,y1,z1,x2,y2,z2...

Autodesk.DesignScript.Interfaces.IRenderPackage.PointVertexColors
A collection containing all mesh vertex colors as r1,g1,b1,a1,r2,g2,b2,a2...

Autodesk.DesignScript.Interfaces.IRenderPackage.PointIndices
A collection containing all point vertex indices.

Autodesk.DesignScript.Interfaces.IRenderPackage.Colors
A collection of bytes representing RGBA colors. This field can be used to populate textures
for mapping onto surfaces. Use the ColorsStride property to define the
size of one dimension of the collection.

Autodesk.DesignScript.Interfaces.IRenderPackage.ColorsStride
The size of one dimension of the Colors collection.

Autodesk.DesignScript.Interfaces.IRenderPackage.AddPointVertex(System.Double,System.Double,System.Double)
Add a point vertex to the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.AddPointVertexColor(System.Byte,System.Byte,System.Byte,System.Byte)
Add a point color to the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.AddTriangleVertex(System.Double,System.Double,System.Double)
Add a triangle vertex location to the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.AddTriangleVertexNormal(System.Double,System.Double,System.Double)
Add a triangle vertex normal to the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.AddTriangleVertexUV(System.Double,System.Double)
Add a triangle texture coordinate to the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.AddTriangleVertexColor(System.Byte,System.Byte,System.Byte,System.Byte)
Add a triangle vertex color to the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.AddLineStripVertex(System.Double,System.Double,System.Double)
Add a line vertex to the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.AddLineStripVertexCount(System.Int32)
Add a line strip vertex count to the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.AddLineStripVertexColor(System.Byte,System.Byte,System.Byte,System.Byte)
Add a line strip vertex color to the render package.

Autodesk.DesignScript.Interfaces.IRenderPackage.ApplyPointVertexColors(System.Byte[])
Apply a color to each point vertex.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Autodesk.DesignScript.Interfaces.IRenderPackage.ApplyLineVertexColors(System.Byte[])
Apply a color to a sequence of line vertices.

Autodesk.DesignScript.Interfaces.IRenderPackage.ApplyMeshVertexColors(System.Byte[])
Apply a color to each mesh vertex.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Autodesk.DesignScript.Interfaces.IRenderPackage.SetColors(System.Byte[])
Set a an array of bytes to be used as a color map.
colors:

Autodesk.DesignScript.Interfaces.IRenderPackage.Clear
Clear all render data from the render package.