Autodesk.DesignScript.Interfaces.IRenderLabels
Represents labels and positions

Autodesk.DesignScript.Interfaces.IRenderLabels.AddLabel(System.String,Autodesk.DesignScript.Interfaces.VertexType,System.Int32)
Add a label position to the render package with position information from an existing geometry vertex.
label: Text to be displayed in the label
vertexType: The type of vertex geometry used to look up a position: Point, Line, or Mesh
index: The index of the vertex geometry used to look up a position

Autodesk.DesignScript.Interfaces.IRenderLabels.AddLabel(System.String,System.Double,System.Double,System.Double)
Add a label position to the render package.
label: Text to be displayed in the label
x:
y:
z:

Autodesk.DesignScript.Interfaces.IRenderLabels.AutoGenerateLabels
A flag indicating whether the render package should auto generate labels based on replication indices

Autodesk.DesignScript.Interfaces.IRenderLabels.ClearLabels
Clear all label data from the render package.