Dynamo.Events.ExecutionEvents
Communication bridge between Dynamo and client libraries to notify
about changes to execution state

Dynamo.Events.ExecutionEvents.GraphPreExecution
The graph is about to evaluate

Dynamo.Events.ExecutionEvents.GraphPostExecution
The graph is done evaluating

Dynamo.Events.ExecutionEvents.ActiveSession
Returns active session for the execution, when Graph is executing.
This property is set to null if graph is not executing.

Dynamo.Events.ExecutionEvents.OnGraphPreExecution(Dynamo.Session.IExecutionSession)
Notify observers that the graph is about to evaluate

Dynamo.Events.ExecutionEvents.OnGraphPostExecution(Dynamo.Session.IExecutionSession)
Notify observers that the graph has evaluated