Autodesk.DesignScript.Runtime.GraphicDataProviderAttribute
This attribute is used to specify the Type of class that implements
IGraphicDataProvider interface in the specified assembly. This
attribute can be used only once at assembly level. Having this attribute
saves the cost of reflection on each exported types to find the type
that implements IGraphicDataProvider interface.