Autodesk.DesignScript.Runtime.ArbitraryDimensionArrayImportAttribute
This attribute is used to marshal parameters or return value of a method
as arbitrary dimension array in DesignScript VM. Usually this attribute
is expected to be applied on IEnumerable derived object types. This
attribute should be used if you expect the IEnumerable parameters or
return value may hold nested collection.