Dynamo.PythonServices.PythonEngine
This abstract class is intended to act as a base class for different python engines.
When you derive from this class to implement a new python engine, ensure all referenced assemblies from the
assembly that contains your python engine type are loadable at runtime or Dynamo will not load your python engine type.

Dynamo.PythonServices.PythonEngine.InputDataMarshaler
Data Marshaler for all data coming into a Python node.

Dynamo.PythonServices.PythonEngine.OutputDataMarshaler
Data Marshaler for all data coming out of a Python node.

Dynamo.PythonServices.PythonEngine.Name
Name of the Python engine

Dynamo.PythonServices.PythonEngine.EvaluationStarted
Add an event handler before the Python evaluation begins

Dynamo.PythonServices.PythonEngine.EvaluationFinished
Add an event handler after the Python evaluation has finished

Dynamo.PythonServices.PythonEngine.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Executes a Python script with custom variable names. Script may be a string
read from a file, for example. Pass a list of names (matching the variable
names in the script) to bindingNames and pass a corresponding list of values
to bindingValues.
code: Python script as a string.
bindingNames: Names of values referenced in Python script.
bindingValues: Values referenced in Python script.