Autodesk.DesignScript.Interfaces.ILegacyPythonCompletionCore
This internal interface exists to support the legacy IronPythonCompletionProvider
without having a compile time reference from PythonNodeModel/WPF on DSIronPython.
This interface should be removed when the legacy class is removed in 3.0.