Autodesk.DesignScript.Interfaces.IGraphicPrimitives
The interface that represents json data for drawing a graphic primitive

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.TriangleVertices
Base-64 encoded array of 32 bit floats, 3 per vertex.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.TriangleNormals
Base-64 encoded array of 32 bit floats, 3 per vertex.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.TriangleVertexColors
Base-64 encoded array of 32 bit unsigned integers, 1 per vertex, in RGBA format.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.TriangleTextureCoordinates
Base-64 encoded array of 32 bit floats, 2 per vertex.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.LineStripVertices
Base-64 encoded array of 32 bit floats, 3 per vertex.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.LineStripCounts
Base-64 encoded array of 32 bit unsigned integers, 1 per line strip, giving the number of vertices in the strip.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.LineStripColors
Base-64 encoded array of 32 bit unsigned integers, 1 per vertex, in RGBA format.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.PointVertices
Base-64 encoded array of 32 bit floats, 3 per vertex.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.PointVertexColors
Base-64 encoded array of 32 bit unsigned integers, 1 per vertex, in RGBA format.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.Colors
Base-64 encoded array of 32 bit unsigned integers in RGBA format, definining a texture to apply to the triangles.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.ColorsStride
Number of values per row in the `Colors` array.

Autodesk.DesignScript.Interfaces.IGraphicPrimitives.RequiresPerVertexColoration
Whether or not the individual vertices should be colored using the data in the corresponding arrays.