Dynamo.Logging.Analytics
Utility class to support analytics tracking.

Dynamo.Logging.Analytics.DisableAnalytics
Disables all analytics collection for the lifetime of the process.

Dynamo.Logging.Analytics.Start(Dynamo.Logging.IAnalyticsClient)
Starts analytics client
client:

Dynamo.Logging.Analytics.ShutDown
Shuts down the client. Application life cycle end is tracked.

Dynamo.Logging.Analytics.IsEnabled
Checks if anlytics tracking is enabled or not. Required for testing.

Dynamo.Logging.Analytics.ReportingAnalytics
Returns if any analytics reporting is ON

Dynamo.Logging.Analytics.TrackStartupTime(System.String,System.TimeSpan,System.String)
Tracks application startup time
productName: Dynamo product name
time: Elapsed time
description: Optional description

Dynamo.Logging.Analytics.TrackEvent(Dynamo.Logging.Actions,Dynamo.Logging.Categories,System.String,System.Nullable{System.Int32})
Tracks an arbitrary event.
action: Action performed
category: Event category
description: Event description
value: A metric value associated with the event

Dynamo.Logging.Analytics.TrackPreference(System.String,System.String,System.Nullable{System.Int32})
Tracks user preference setting and its value.
name: Name of the preference
stringValue: Preference value as string
metricValue: Metric value of the preference

Dynamo.Logging.Analytics.TrackTimedEvent(Dynamo.Logging.Categories,System.String,System.TimeSpan,System.String)
Tracks a timed event, when it has completed.
category: Event category
variable: Timed variable name
time: Time taken by the event
description: Event description

Dynamo.Logging.Analytics.TrackScreenView(System.String)
Tracks screen view, such as Node view, Geometry view, Custom workspace etc.
viewName: Name of the screen

Dynamo.Logging.Analytics.TrackActivityStatus(System.String)
Tracks user/machine idle and active states while using the application.
activityType: Defines the activity type i.e: machine or user

Dynamo.Logging.Analytics.TrackException(System.Exception,System.Boolean)
Tracks an exception. If the exception is fatal, its recorded as crash.
ex: Exception
isFatal: If it's fatal

Dynamo.Logging.Analytics.CreateTimedEvent(Dynamo.Logging.Categories,System.String,System.String,System.Nullable{System.Int32})
Creates a new timed event with start state and tracks its start.
Disposing the returned event will record the event completion.
category: Event category
variable: Timed varaible name
description: Event description
value: A metric value associated with the event
Returns: Event as IDisposable

Dynamo.Logging.Analytics.CreateTaskTimedEvent(Dynamo.Logging.Categories,System.String,System.String,System.Nullable{System.Int32})
Creates a new task timed event with start state and tracks its start.
After the task is completed, disposing the returned event will record the event completion.
category: Event category
variable: Timed varaible name
description: Event description
value: A metric value associated with the event
Returns: Task defined by an IDisposable event

Dynamo.Logging.Analytics.TrackCommandEvent(System.String,System.String,System.Nullable{System.Int32})
Creates a new command event of the given name. Start of the
command is tracked. When the event is disposed, it's completion is tracked.
name: Command name
description: Event description
value: A metric value associated with the event
Returns: Task defined by an IDisposable event

Dynamo.Logging.Analytics.TrackTaskCommandEvent(System.String,System.String,System.Nullable{System.Int32},System.Collections.Generic.IDictionary{System.String,System.Object})
Creates a new command event task of the given name. Start of the
command is tracked. When the task is completed and the event is disposed, it's completion is tracked.
name: Command name
description: Event description
value: A metric value associated with the event
parameters: A dictionary of (string, object) associated with the event
Returns: Task defined by an IDisposable event

Dynamo.Logging.Analytics.TrackFileOperationEvent(System.String,Dynamo.Logging.Actions,System.Int32,System.String)
Creates a new file operation event and tracks the start of the event.
Disposing the returned event will record its completion.
filepath: File path
operation: File operation
size: Size parameter
description: Event description
Returns: Event as IDisposable

Dynamo.Logging.Analytics.TrackTaskFileOperationEvent(System.String,Dynamo.Logging.Actions,System.Int32,System.String)
Creates a new task file operation event and tracks the start of the event.
After the task is completed, disposing the returned event will record its completion.
filepath: File path
operation: File operation
size: Size parameter
description: Event description
Returns: Task defined by an IDisposable event