Autodesk.DesignScript.Interfaces.IGraphicItem
Represents a graphics item object, that can provide tesselated data
into the given render package.

Autodesk.DesignScript.Interfaces.IGraphicItem.Tessellate(Autodesk.DesignScript.Interfaces.IRenderPackage,Autodesk.DesignScript.Interfaces.TessellationParameters)
Returns the graphics/tesselation data in given render package object.
package: The render package, where graphics data to be
pushed.
parameters: