Autodesk.DesignScript.Interfaces.ConfigurationKeys.GeometryFactory
This key is used to configure the library filename, which implements
IGeometryFactory interface.

Autodesk.DesignScript.Interfaces.ConfigurationKeys.PersistentManager
This key is used to configure the library filename, which implements
IPersistenceManager interface.

Autodesk.DesignScript.Interfaces.ConfigurationKeys.GeometryProvider
This key is used to set/get IContextDataProvider implementation
by host application.

Autodesk.DesignScript.Interfaces.ConfigurationKeys.SessionDatabase
This key is used to set the session database object for the host
application. THIS IS NOW DEPRECATED (use "SessionKey" instead).

Autodesk.DesignScript.Interfaces.ConfigurationKeys.SessionKey
This key is used to set the session key (by the host application)
which is understood by the corresponding IPersistenceManager when
it comes to telling one session from another. An example of
session would be the documents in the host application, a host
document can be identified with a session key, and each host
document has a unique session key that IPersistenceManager can use
to differentiate between two documents. The corresponding value
for SessionKey is a value of "string" type.

Autodesk.DesignScript.Interfaces.ConfigurationKeys.RequestExplicitLock
This key is used to request explicit lock on database by the host
application before execution of the script. The corresponding value
is bool.

Autodesk.DesignScript.Interfaces.ConfigurationKeys.RecordingUserActions
This key is used to check if the application is recording user actions.
The corresponding value is bool.

Autodesk.DesignScript.Interfaces.ConfigurationKeys.ClearPersistedObjects
This key is used to determine if the persistent objects should be cleared on
screen before each run. In live execution scenarios like DesignScript Studio,
there is no clear distinction between runs. For more information, please see
"AsmExtensionApplication::OnBeginExecution" in "AsmExtensionApplication.cpp".

Autodesk.DesignScript.Interfaces.ConfigurationKeys.GeometricPreviewEnabled
This key is being referenced in "DesignScriptStudio.Graph.Ui.GraphControl"
as a way to determine if the underlying "RenderService" should be enabled.
The default behaviour (if this flag is not specified) is to enable geometric
preview. The "object" value being passed for this configuration key is
expected to be a "bool" object rather than a "string" object.

Autodesk.DesignScript.Interfaces.ConfigurationKeys.FilteredClasses
This key is being referenced in "DesignScriptStudio.Graph.Ui.GraphControl"
as a way to filtered out classes that is currently not supported in ProtoGL.
The "object" value being passed for this configuration key is
expected to be a "string" object which specified the assembly and class that
should be hidden. The location of the config file is "\installtools\Bundle\
DesignScript.bundle\Contents\Win64" The format of the string should be
"%assemblyName%;%className&;..;%assemblyName%;%className&;",
The CoreCoponent will look for "%assemblyName%;%className&;" (with two ';' at
end of assembly name and class name) and filter the fully matched item out

Autodesk.DesignScript.Interfaces.ConfigurationKeys.GeometryXmlProperties
This key is referenced in the geometry test framework.
The value type for this key is bool.
If the value is true, that means the core will generate XML properties.