Dynamo.Events.WorkspaceEvents.WorkspaceAdded
An event that is triggered when a workspace is added
to the DynamoModel's Workspaces collection.

Dynamo.Events.WorkspaceEvents.WorkspaceRemoveStarted
An event that is triggered prior to the removal of the workspace
from the Workspaces collection.

Dynamo.Events.WorkspaceEvents.WorkspaceRemoved
An event that is triggered when a workspace is removed
from the DynamoModel's Workspaces collection.

Dynamo.Events.WorkspaceEvents.WorkspaceClearing
An event that is triggered before a workspace is cleared.

Dynamo.Events.WorkspaceEvents.WorkspaceCleared
An event that is triggered after a workspace is cleared.

Dynamo.Events.WorkspaceEvents.WorkspaceSettingsChanged
An event raised when workspace ScaleFactor setting is changed.

Dynamo.Events.WorkspaceEvents.WorkspaceEnableLegacyPolyCurveSettingChanged
An event raised when workspace EnableLegacyPolyCurveBehavior setting is changed.