DynamoServices.LogWarningMessageEvents.LogInfoMessage
event handler for logging info message

DynamoServices.LogWarningMessageEvents.LogWarningMessage
event handler for logging warning message

DynamoServices.LogWarningMessageEvents.OnLogWarningMessage(System.String)
Log node warning message
message: warning message

DynamoServices.LogWarningMessageEvents.OnLogInfoMessage(System.String)
Log node info message
message: info message