Autodesk.DesignScript.Interfaces.IExecutionSession
Represents a session object for current execution.

Autodesk.DesignScript.Interfaces.IExecutionSession.Configuration
Returns the configuration object for this execution session.

Autodesk.DesignScript.Interfaces.IExecutionSession.SearchFile(System.String)
Searches the given file and returns full path, if found.
filename: File name to search.
Returns: Full path of given filename or empty string if file not
found.