Autodesk.DesignScript.Interfaces.IExtensionApplication
An FFI library can implement this interface to get some notifications
from DesignScript application.

Autodesk.DesignScript.Interfaces.IExtensionApplication.StartUp(Autodesk.DesignScript.Interfaces.ExtensionStartupParams)
Called when first time this application is loaded.

Autodesk.DesignScript.Interfaces.IExtensionApplication.OnBeginExecution(Autodesk.DesignScript.Interfaces.IExecutionSession)
Called when script execution starts.
session: Execution session object with which script
execution starts.

Autodesk.DesignScript.Interfaces.IExtensionApplication.OnSuspendExecution(Autodesk.DesignScript.Interfaces.IExecutionSession)
Called when script execution is suspended for debugging/inspection
session: Execution session object with which script
execution starts.

Autodesk.DesignScript.Interfaces.IExtensionApplication.OnResumeExecution(Autodesk.DesignScript.Interfaces.IExecutionSession)
Called when script execution is resumed after debugging/inspection
session: Execution session object with which script
execution starts.

Autodesk.DesignScript.Interfaces.IExtensionApplication.OnEndExecution(Autodesk.DesignScript.Interfaces.IExecutionSession)
Called when script execution has ended.
session: Execution session object with which script
execution had started.

Autodesk.DesignScript.Interfaces.IExtensionApplication.ShutDown
Called when designscript application is shutting down.

Autodesk.DesignScript.Interfaces.IExtensionApplication.PreloadAsmLibraries(System.String)
Preloads unmanaged ASM libraries
baseDirectory: