Autodesk.DesignScript.Interfaces.ExtensionStartupParams
An options structure used when calling IExtensionApplication.Startup

Autodesk.DesignScript.Interfaces.ExtensionStartupParams.DisableADP
Disables ADP data collection.