Autodesk.DesignScript.Interfaces.IExternalCodeCompletionData
This interface is essentially the same as ICompletionData from AvalonEdit
except it does not include any references to WPF.

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionData.CompletionType
The CompletionType this completionData represents.

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionData.Text
Gets the text. This property is used to filter the list of visible elements.

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionData.Content
The displayed content. This can be the same as 'Text', or a WPF UIElement if
you want to display rich content.

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionData.Description
Gets the description.

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionData.Priority
Gets the priority. This property is used in the selection logic. You can use
it to prefer selecting those items which the user is accessing most frequently.