Autodesk.DesignScript.Interfaces.IRenderInstancedLabels
Internal interface to enable adding labels that are related to an instanceableGraphicItem.

Autodesk.DesignScript.Interfaces.IRenderInstancedLabels.AddInstancedLabel(System.String,Autodesk.DesignScript.Interfaces.VertexType,System.Int32,System.Int32,System.Guid)
Adds a label to the render package, but first transforms the label by the transform matrix of the
relevant graphicItem.
label: label
vertexType: type of vertex
vertIndex: vertex index for base label position
instanceIndex: index to use for transform matrix
BaseTessellationId: baseTessellation Id of the item this label belongs to.
Aids in lookup of the correct transform matrix.

Autodesk.DesignScript.Interfaces.IRenderInstancedLabels.InstanceCount(System.Guid)
Number of instances for a particular baseTessellation type(cuboid, sphere etc)
baseTessellationID:
Returns: returns -1 if id cannot be found in package.