Dynamo.PythonServices.PythonEngineManager
Singleton class that other class can access and use for query loaded Python Engine info.

Dynamo.PythonServices.PythonEngineManager.lazy
Use Lazy<PythonEngineManager> to make sure the Singleton class is only initialized once

Dynamo.PythonServices.PythonEngineManager.Instance
The actual instance stored in the Singleton class

Dynamo.PythonServices.PythonEngineManager.AvailableEngines
An observable collection of all the loaded Python engines

Dynamo.PythonServices.PythonEngineManager.CPython3EngineName
CPython Engine name

Dynamo.PythonServices.PythonEngineManager.IronPython2EngineName
IronPython2 Engine name

Dynamo.PythonServices.PythonEngineManager.#ctor
Singleton class initialization logic which will be run in a lazy way the first time Dynamo try to evaluate a Python node

Dynamo.PythonServices.PythonEngineManager.VerifyEngineReferences(System.Reflection.Assembly,System.Collections.Generic.IEnumerable{System.String})
Attempts to verify that the dependencies of the given assembly can be found and loaded into an MetadataLoadContext.
Will throw exceptions if assemblies cannot be loaded.
Used to avoid loading python engines that can only be partially loaded and will fail later at a worse time.
assembly: assembly to check references
standardPaths: standard set of assembly paths that will be used to resolve the assemblt references