Autodesk.DesignScript.Interfaces.IRenderPackageSupplement
This interface provides additional methods adding for color information to a render package.

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.PointVertexColorCount
The number of point vertices colors in the package (Optimized for speed).

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.LineVertexColorCount
The number of line vertices colors in the package (Optimized for speed).

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.MeshVertexColorCount
The number of mesh vertices colors in the package (Optimized for speed).

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.UpdatePointVertexColorForRange(System.Int32,System.Int32,System.Byte,System.Byte,System.Byte,System.Byte)
Update a color to a range of point vertices.
startIndex: The index associated with the first vertex in PointVertices we want to associate with a color
endIndex: The index associated with the last vertex in PointVertices we want to associate with a color
red: byte for the red RGB value
green: byte for the green RGB value
blue: byte for the blue RGB value
alpha: byte for the alpha RGB value

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.AppendPointVertexColorRange(System.Byte[])
Append a color range for point vertices.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.UpdateLineVertexColorForRange(System.Int32,System.Int32,System.Byte,System.Byte,System.Byte,System.Byte)
Update a color to a range of line vertices.
startIndex: The index associated with the first vertex in LineVertices we want to associate with a color
endIndex: The index associated with the last vertex in LineVertices we want to associate with a color
red: byte for the red RGB value
green: byte for the green RGB value
blue: byte for the blue RGB value
alpha: byte for the alpha RGB value

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.AppendLineVertexColorRange(System.Byte[])
Append a color range for line vertices.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.UpdateMeshVertexColorForRange(System.Int32,System.Int32,System.Byte,System.Byte,System.Byte,System.Byte)
Update a color to a range of of mesh vertices.
startIndex: The index associated with the first vertex in MeshVertices we want to associate with a color
endIndex: The index associated with the last vertex in MeshVertices we want to associate with a color
red: byte for the red RGB value
green: byte for the green RGB value
blue: byte for the blue RGB value
alpha: byte for the alpha RGB value

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.AppendMeshVertexColorRange(System.Byte[])
Append a color range for mesh vertex.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.TextureMapsList
A List containing arrays of bytes representing RGBA colors.
These arrays can be used to populate textures for mapping onto specific meshes

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.TextureMapsStrideList
A list containing the size of one dimension of the associated texture map array in TextureMapsList.

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.MeshVerticesRangesAssociatedWithTextureMaps
A list of mesh vertices ranges that have associated texture maps

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.AddTextureMapForMeshVerticesRange(System.Int32,System.Int32,System.Byte[],System.Int32)
Set a color texture map for a specific range of mesh vertices
startIndex: The index associated with the first vertex in MeshVertices we want to associate with the texture map
endIndex: The index associated with the last vertex in MeshVertices we want to associate with the texture map
textureMap: An array of bytes representing RGBA colors to be used as a color texture map
stride: The size of one dimension of the colors array

Autodesk.DesignScript.Interfaces.IRenderPackageSupplement.AllowLegacyColorOperations
Allow legacy usage of the color methods in IRenderPackage
This flag is used by the UpdateRenderPackageAsyncTask implementation to flag
any third party usage of deprecated color methods in IRenderPackage API