DynamoUnits.Display
Data used to set display and formatting preferences for Dynamo UI

DynamoUnits.Display.PrecisionFormat
Precision format for number of decimals to display within Dynamo UI

DynamoUnits.Display.Precision
Number of Decimals to display within Dynamo UI

DynamoUnits.Display.UnitNumberFormat
Format to display unitized values within the Dynamo UI

DynamoUnits.Display.RemoveTrailingZeros
Remove trailing zeros for unitized decimal values within the Dynamo UI