Dynamo.Session.ParameterKeys
List of possible session parameter keys to obtain the session parameters.

Dynamo.Session.ParameterKeys.GeometryFactory
This key is used to get the full path for library, which implements
IGeometryFactory interface.

Dynamo.Session.ParameterKeys.NumberFormat
This key is used to get the number format used by Dynamo to format
the preview values. The returned value is string.

Dynamo.Session.ParameterKeys.MajorVersion
This key is used to get the Major version of Dynamo. The returned value
is a number.

Dynamo.Session.ParameterKeys.MinorVersion
This key is used to get the Major version of Dynamo. The returned value
is a number.

Dynamo.Session.ParameterKeys.LastExecutionDuration
The duration of an execution covered by an Dynamo.Session.IExecutionSession

Dynamo.Session.ParameterKeys.PackagePaths
The current collection of packagepaths that Dynamo is loading packages from.
The Return value is IEnumerable

Dynamo.Session.ParameterKeys.Logger
The logger that logs to the Dynamo console.
The return value is an ILogger