Autodesk.DesignScript.Interfaces.IExternalCodeCompletionProviderCore.VariableTypes
Already discovered variable types

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionProviderCore.ImportedTypes
Types that have already been imported into the scope

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionProviderCore.GetCompletionData(System.String,System.Boolean)
Generate completion data for the specified text, while import the given types into the
scope and discovering variable assignments.
code: The code to parse
expand: Determines if the entire namespace should be used
Returns: Return a list of IronPythonCompletionData

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionProviderCore.GetDescription(System.String,System.String,System.Boolean)
Try to generate a description from a typename.
stub: Everything before the last namespace or type name e.g. System.Collections in System.Collections.ArrayList
item: Everything after the stub
isInstance: Whether it's an instance or not

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionProviderCore.IsSupportedEngine(System.String)
Used to determine if this IExternalCodeCompletionProviderCore can provide completions for the given engine.
engineName:
Returns:

Autodesk.DesignScript.Interfaces.IExternalCodeCompletionProviderCore.Initialize(System.String)
Used to load initialize libraries and types that should be available by default.
dynamoCorePath: