Autodesk.DesignScript.Runtime.PreferredShortNameAttribute
This attribute can be applied to class to give a hint for generating
variable name in node to code. For example, generating variable "vec"
for Vector.