Dynamo.Logging.IAnalyticsClient
Implements analytics and logging functions. This interface is defined
for internal use only to implement analytics functions and mock the tests.

Dynamo.Logging.IAnalyticsClient.ReportingAnalytics
Checks if analytics reporting is ON.

Dynamo.Logging.IAnalyticsClient.Start
Starts the client when DynamoModel is created. This method initializes
the Analytics service and application life cycle start is tracked.

Dynamo.Logging.IAnalyticsClient.ShutDown
Shuts down the client. Application life cycle end is tracked.

Dynamo.Logging.IAnalyticsClient.TrackEvent(Dynamo.Logging.Actions,Dynamo.Logging.Categories,System.String,System.Nullable{System.Int32})
Tracks an arbitrary event.
action: Action performed
category: Event category
description: Event description
value: A metric value associated with the event

Dynamo.Logging.IAnalyticsClient.TrackPreference(System.String,System.String,System.Nullable{System.Int32})
Tracks a preference setting and its value.
name: Name of the preference
stringValue: Preference value as string
metricValue: Metric value of the preference

Dynamo.Logging.IAnalyticsClient.TrackTimedEvent(Dynamo.Logging.Categories,System.String,System.TimeSpan,System.String)
Tracks a timed event, when it has completed.
category: Event category
variable: Timed variable name
time: Time taken by the event
description: Event description

Dynamo.Logging.IAnalyticsClient.TrackScreenView(System.String)
Tracks screen view, such as Node view, Geometry view, Custom workspace etc.
viewName: Name of the screen

Dynamo.Logging.IAnalyticsClient.TrackException(System.Exception,System.Boolean)
Tracks an exception. If the exception is fatal, its recorded as crash.
ex: Exception
isFatal: If it's fatal

Dynamo.Logging.IAnalyticsClient.TrackActivityStatus(System.String)
This API is used to track user/machine's activity status.
activityType: Value must be: machine or user. If no value is provided the API will default to user activity type.
Returns: 0 if successful, otherwise returns an error code.

Dynamo.Logging.IAnalyticsClient.CreateTimedEvent(Dynamo.Logging.Categories,System.String,System.String,System.Nullable{System.Int32})
Creates a new timed event with start state and tracks its start.
Disposing the returnd event will record the event completion.
category: Event category
variable: Timed varaible name
description: Event description
value: A metric value associated with the event
Returns: Event as IDisposable

Dynamo.Logging.IAnalyticsClient.CreateTaskTimedEvent(Dynamo.Logging.Categories,System.String,System.String,System.Nullable{System.Int32})
Creates a new task timed event with start state and tracks its start.
After task is compoleted, disposing the returnd event will record the event completion.
category: Event category
variable: Timed varaible name
description: Event description
value: A metric value associated with the event
Returns: Event as IDisposable

Dynamo.Logging.IAnalyticsClient.CreateCommandEvent(System.String,System.String,System.Nullable{System.Int32})
Creates a new command event of the given name. Start of the
command is tracked. When the event is disposed, it's completion is tracked.
name: Command name
description: Event description
value: A metric value associated with the event
Returns: Event as IDisposable

Dynamo.Logging.IAnalyticsClient.CreateTaskCommandEvent(System.String,System.String,System.Nullable{System.Int32},System.Collections.Generic.IDictionary{System.String,System.Object})
Creates a new task command event of the given name. Start of the
command is tracked. When the task is completed and the event is disposed, it's completion is tracked.
name: Command name
description: Event description
value: A metric value associated with the event
parameters: A dictionary of (string, object) associated with the event
Returns: Event as IDisposable

Dynamo.Logging.IAnalyticsClient.EndEventTask(System.Threading.Tasks.Task{System.IDisposable})
Waits for the given task to end so that it can dispose the event and
complete the tracking.

Dynamo.Logging.IAnalyticsClient.TrackFileOperationEvent(System.String,Dynamo.Logging.Actions,System.Int32,System.String)
Creates a new file operation event and tracks the start of the event.
Disposing the returned event will record its completion.
filepath: File path
operation: File operation
size: Size parameter
description: Event description
Returns: Event as IDisposable

Dynamo.Logging.IAnalyticsClient.TrackTaskFileOperationEvent(System.String,Dynamo.Logging.Actions,System.Int32,System.String)
Creates a new file operation task event and tracks the start of the event.
After the task is completed, disposing the returned event will record its completion.
filepath: File path
operation: File operation
size: Size parameter
description: Event description
Returns: Event as IDisposable