Autodesk.DesignScript.Interfaces.IInstanceableGraphicItem
An interface that defines items whose graphics are defined by a single base tessellation and instance transforms defined by 4x4 transformation matrices.

Autodesk.DesignScript.Interfaces.IInstanceableGraphicItem.BaseTessellationGuid
A Guid used to reference the base tessellation geometry that will be transformed for all related instances

Autodesk.DesignScript.Interfaces.IInstanceableGraphicItem.InstanceInfoAvailable
A flag used to indicate if the current geometrical configuration of an item has instance information.

Autodesk.DesignScript.Interfaces.IInstanceableGraphicItem.AddBaseTessellation(Autodesk.DesignScript.Interfaces.IInstancingRenderPackage,Autodesk.DesignScript.Interfaces.TessellationParameters)
Adds the base graphics/tesselation data in given render package object.
package: The render package, where base tessellation will be
pushed.
parameters: tessellation parameters for the instance. Can be used to generate the
correct shared base tessellation

Autodesk.DesignScript.Interfaces.IInstanceableGraphicItem.AddInstance(Autodesk.DesignScript.Interfaces.IInstancingRenderPackage,Autodesk.DesignScript.Interfaces.TessellationParameters,System.String)
Adds an instance matrix for this geometry.
package: The render package, where instance will be
pushed.
parameters: tessellation parameters for the instance, only scale factor is generally applicable.
labelKey: the strig label key that specifices which result this instance represents in a node's output.