Autodesk.DesignScript.Runtime.ContextDataProviderAttribute
This attribute is used to specify the Type of class that implements
IContextDataProvider interface in the specified assembly. This
attribute can be used only once at assembly level. Having this attribute
saves the cost of reflection on each exported types to find the type
that implements IContextDataProvider interface.

Autodesk.DesignScript.Runtime.ContextDataProviderAttribute.#ctor(System.Type,System.Func{System.Boolean})
Constructor to construct this attribute with a delegate to check
whether this data provider captures data.
dataProviderType: Type that implements
IContextDataProvider interface
capturesData: Delegate to check if the provider can
capture data

Autodesk.DesignScript.Runtime.ContextDataProviderAttribute.#ctor(System.Type)
Constructor
dataProviderType: Type that implements
IContextDataProvider interface

Autodesk.DesignScript.Runtime.ContextDataProviderAttribute.Type
Type implementing IContextDataProvider interface.

Autodesk.DesignScript.Runtime.ContextDataProviderAttribute.CapturesData
Checks if this type can capture data interactively