Autodesk.DesignScript.Interfaces.IConfiguration
Provides application configuration

Autodesk.DesignScript.Interfaces.IConfiguration.RootModulePath
Provides the path of main executing script

Autodesk.DesignScript.Interfaces.IConfiguration.IncludeDirectories
Provides list of include directories.

Autodesk.DesignScript.Interfaces.IConfiguration.GetConfigValue(System.String)
Returns application defined configuration value.
config: Configuration name
Returns: Configuration value

Autodesk.DesignScript.Interfaces.IConfiguration.SetConfigValue(System.String,System.Object)
Set application defined configuration value.
config: Configuration name
value: Configuration value