Autodesk.DesignScript.Geometry.Topology.Vertices
The Vertices of the Topology

Autodesk.DesignScript.Geometry.Topology.Edges
The Edges of the Topology

Autodesk.DesignScript.Geometry.Topology.Faces
The Faces of the Topology