Autodesk.DesignScript.Geometry.Properties.Resources.curve_dividebydistance_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use 'PointsAtEqualChordLength' and 'SplitByPoints' instead.

Autodesk.DesignScript.Geometry.Properties.Resources.curve_dividebydistancefromparam_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use 'PointsAtChordLengthFromPoint' and 'SplitByPoints' instead..

Autodesk.DesignScript.Geometry.Properties.Resources.curve_dividebylengthfromparams_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use 'PointsAtSegmentLengthFromPoint' and 'SplitByPoints' instead..

Autodesk.DesignScript.Geometry.Properties.Resources.curve_divideequally_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use 'PointsAtEqualSegmentLength' and 'SplitByPoints' instead..

Autodesk.DesignScript.Geometry.Properties.Resources.geometry_exporttosat_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use ExportToSAT UI node instead.

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Looks up a localized string similar to You have exceeded the allowable modeling extents, consider choosing smaller values.

Autodesk.DesignScript.Geometry.Properties.Resources.solid_unionall_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use Solid.ByUnion instead.