Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.Info
A bunch of TSVertex properties: uvnFrame, index, valence and functionalValence, whether TSVertex is a StarPoint, TPoint, Manifold or not
Returns: