Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Create an EllipseArc in a plane with the given the radii along the X and Y axes and the angles to sweep through
plane:  Plane containing the ellipse arc
xRadius:  The radius of the EllipseArc in the X direction of the Plane
yRadius:  The radius of the EllipseArc in the Y direction of the Plane
startAngle:  The start angle of the arc as measured from the positive x-axis of the input plane
sweepAngle:  The angle to sweep from the start angle in degrees
Returns:  Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Create an EllipseArc in a plane with the given the radii along the X and Y axes and the angles to sweep through
plane:  The plane the EllipseArc is contained in
xRadius:  The radius of the EllipseArc in the X direction of the Plane
yRadius:  The radius of the EllipseArc in the Y direction of the Plane
startAngle:  The start angle of the arc as measured from the positive x-axis of the input plane
sweepAngle:  The angle to sweep from the start angle in degrees
Returns:
ellipsearc,arcs