Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Geometry Type registration mechanism.
hostType: Type of IGeometryEntity derived interfaces.
contructor: A delegate to construct Geometry.

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Translate geometry in the given direction by the vector length
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforms geometry by the given transform of CoordinateSystem
Returns: Transformed geometry

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforms this geometry from source CoordinateSystem to a new
context CoordinateSystem.
fromCoordinateSystem:
contextCoordinateSystem:
Returns: Transformed Geometry.
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotates an object around the Plane origin and normal by a specified
degree
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Scale non-uniformly around the origin
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Scale non-uniformly around a given Plane
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale uniformly around a given point, using two pick points as scalars
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale in one dimension by base and 2 pick points. The scaling axis is defined by the line between base and from point.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale in two dimension by base and 2 pick points  The two pick points are projected onto the base plane in order to determine the 2d scale factors
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Obtain the distance from this Geometry to another
other: The other Geometry
Returns: The distance
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Obtain the closest Point on this Geometry to the other
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Determine if another Geometry object intersects with this one
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Get the intersection Geometry for this object and another
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Get the intersection of Geometry for this object and a collection of other Geometries. Finds common geometry of all participants.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Split this Geometry using another Geometry as a cutting "tool"
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Check if the two objects have the same representational geometry or numerical values
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Get the BoundingBox containing the given piece of Geometry
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Convert geometry to Solid Def json
Returns: Json formatted string

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
Exports the specified geometry to the given SAT file path
filePath: The name of the file to export the geometry to
Returns:

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
Exports the specified geometry to the given SAT file path
filePath: The name of the file to export the geometry to
unitsMM: The units to use
Returns:

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
Exports a list of specified geometry to the given SAT file path
geometry:
filePath:
unitsMM:
Returns:

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
Serializes the specified geometry into Standard ACIS Binary(SAB) format and returns serialized binary stream data
Returns:

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
Get the context/reference coordinate system that was used to create this geometry.