Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.ByRadial(System.Int32)
Create a radial TSplineInitialSymmetry with given amount of spans per symmetric segment.
symmetricFaces:
Returns:
tspline,symmetry

Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.ByAxial(System.Boolean,System.Boolean,System.Boolean)
Create an axial TSplineInitialSymmetry with given symmetry axes.
xAxis:
yAxis:
zAxis:
Returns:
tspline,symmetry