Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Get a hashcode for this type
Returns: A unique hashcode for this object

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Create an IndexGroup storing four indices
a:  Index a
b:  Index b
c:  Index c
d:  Index d
Returns:  IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Create an IndexGroup storing three indices
a:  Index a
b:  Index b
c:  Index c
Returns:  IndexGroup
tri,polygon,mesh,meshes