Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.DecomposedVertices
Decomposed Vertices differed by type
Returns:  Set of vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.DecomposedEdges
Decomposed Edges differed by type
Returns:  Set of edges

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.DecomposedFaces
Decomposed Faces differed by type
Returns:  Set of faces

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Return vertex at given index
index:  Index to get vertex at
Returns:  T-Spline Vertex
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Return edge at given index
index:  Index to get edge at
Returns:  T-Spline Edge
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Return face at given index
index:  Index to get face at
Returns:  T-Spline Face
tspline,face,byindex