Autodesk.DesignScript.Geometry.Vertex.PointGeometry
The Point where this Vertex is located

Autodesk.DesignScript.Geometry.Vertex.AdjacentEdges
The Edges emanating from this Vertex

Autodesk.DesignScript.Geometry.Vertex.AdjacentFaces
The Faces adjacent to this Vertex