Autodesk.DesignScript.Geometry.Edge.CurveGeometry
The underlying Curve making up the Edge

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
The Faces adjacent to this Edge

Autodesk.DesignScript.Geometry.Edge.StartVertex
The Vertex at which this Edge starts

Autodesk.DesignScript.Geometry.Edge.EndVertex
The Vertex at which this Edge ends

Autodesk.DesignScript.Geometry.Edge.CoEdges
The CoEdges associated with this Edge