Autodesk.DesignScript.Geometry.Face.Edges
All of the Edges around this Face in counterclockwise order
faces
1

Autodesk.DesignScript.Geometry.Face.Vertices
All of the Vertices around this Face in counterclockwise order
faces
1

Autodesk.DesignScript.Geometry.Face.Loops
All of the Loops contained by this Face

Autodesk.DesignScript.Geometry.Face.SurfaceGeometry
The underlying Surface making up the Face
Returns:  Surface representation of face