Autodesk.DesignScript.Geometry.Solid.ByJoinedSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Create a solid by specifying it's component faces as Surfaces.
facesOfSolid:
Returns:
Brep,brep

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Create a Solid by lofting between input cross section closed Curves.
crossSections:
Returns:
Brep,brep

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Create a Solid by lofting between input cross section closed Curves,  with guide Curve to assist. Guide Curve must intersect all cross section Curves.
crossSections:
guideCurve:
Returns:
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Create a Solid by lofting between input cross section closed Curves,  with guide Curves to assist. Guide Curves must intersect all cross  section Curves.
crossSections:
guideCurves:
Returns:
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Create a Solid by lofting between input cross-sections comprising of closed PolyCurves. This operation is optimized for sections composed of line segments exclusively, with vertices following the same order. The check and repair option guarantees the validity of the produced solid when enabled, while disabling it should increase performance.
crossSections:
checkAndRepair:
Returns:
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Sweep a closed Curve along a path.
profile:
path:
Returns:
Brep,brep,sweep1

Autodesk.DesignScript.Geometry.Solid.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean)
Sweep a closed Curve along a path.
profile:  A closed curve that will be the profile of the sweep
path:  The path that represent the sweep path
cutEndOff:  Cut the end of the sweep and make it normal to the path
Returns:  A solid by sweeping the profile curve along a path
Brep,brep,sweep1

Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Sweep a closed profile Curve along two rail Curves.
path:  The input path to sweep along.
guideRail:  A rail to guide the orientation of the sweep.
profile:  The profile curve to sweep along the path
Returns:
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Create a Solid of revolution, sweeping the profile Curve around the axis Ray formed by the origin and the axis Vector, from the start angle in degrees to the sweep angle in degrees.
profile:  Profile curve to revolve
axisOrigin:  Revolving axis origin
axisDirection:  Revolving axis direction
startAngle:  Start angle in degrees
sweepAngle:  Sweep angle in degrees
Returns:  Solid created by revolve
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Union a collection of solids into one solid
solids:  A collection of solids
Returns:
Brep,brep,boolean,addition

Autodesk.DesignScript.Geometry.Solid.Centroid
The centroid of the Solid
Returns:
average,center

Autodesk.DesignScript.Geometry.Solid.Union(Autodesk.DesignScript.Geometry.Solid)
The boolean union of this Solid and another.
solid:
Returns:
addition,merge,combine

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Unions a list of Solids with this Solid.
solids:
Returns:
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
The boolean difference of this Solid with another
other:
Returns:

Autodesk.DesignScript.Geometry.Solid.DifferenceAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
The boolean difference of this Solid and the union of input Solids
others:
Returns:
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Obtain a solid Shell from the Faces of this Solid
internalFaceThickness:  Distance to extend the shell inwards
externalFaceThickness:  Distance to extend she shell outwards
Returns:
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projects the input Geometry onto this Solid in the input Vector direction.  !!This projection method currently supports only points or curves!!
geometryToProject:
projectDirection:
Returns:
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Fillet(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Double)
Fillets a Solid along input Edges with a given radius.
edges:
radius:
Returns:
round,smooth,smoothedge,roundedges

Autodesk.DesignScript.Geometry.Solid.Chamfer(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Double)
Chamfers a Solid along input Edges with a given offset from the edge corner.
edges:
offset:
Returns:
bevel,flattenedges

Autodesk.DesignScript.Geometry.Solid.Separate
Separates a Solid into individual Solids if it comprises more than one disjoint lump. Returns the same Solid if it is a single contiguous lump.
Returns:  separate disjoint solids
split,disjoint