Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Create a Helix. The helix always rotates clockwise about the supplied  axis direction. If viewing along the axis direction, the viewer will see  the point turning clockwise around the axis as it moves along the curve  in the direction of increasing parameter. Pitch is Distance the helix  moves in the axis direction per turn. This can be positive or negative.
axisPoint:  Axis point
axisDirection:  Axis direction vector
startPoint:  Helix start point
pitch:  Distance of the helix per each 360 degrees in the direction of the axis
angleTurns:  How many turns in degrees
Returns:  Helix created by axis
helix,screw,corkscrew,thread