Autodesk.DesignScript.Geometry.PanelSurface.ByParallelograms(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,System.Double,System.Boolean,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in parallelograms tiled vertically and horizontally. Each parallelogram is a square with a shear applied along the V-axis or U-axis determined by the ‘alignWithUAxis’ input and a shear factor. By default the parallelograms are aligned with the V-axis.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
shearFactor: The amount of shear
alignWithUAxis: When set to True, paralellograms are aligned with the U-Axis
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, parallelogram

Autodesk.DesignScript.Geometry.PanelSurface.ByCustomOrthogonalLattice(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, custom, orthogonal, lattice

Autodesk.DesignScript.Geometry.PanelSurface.GetNumPanelVertices(System.Int32[])
Returns the number of vertices for each panel in the list of panel indices.
panelIndices: Panel indices used to query the number of vertices. The default value of null indicates all panels in the surface.
Returns: number of vertices

Autodesk.DesignScript.Geometry.PanelSurface.GetPanelVertices(System.Int32[])
Returns the vertices for each panel in the list of panel indices.
panelIndices: Panel indices used to query vertices. The default value of null indicates all panels in the surface.
Returns: Vertex array

Autodesk.DesignScript.Geometry.PanelSurface.GetPanelPoints(System.Int32[])
Returns the points for each panel in the list of panel indices.
panelIndices: Panel indices used to query points. The default value of null indicates all panels in the surface.
Returns: Point Array

Autodesk.DesignScript.Geometry.PanelSurface.GetPanelPolygon(System.Int32[])
Returns the polygonal boundary for each panel in the list of panel indices.
panelIndices: Panel indices used to construct Polygons. The default value of null indicates all panels in the surface.
Returns: