Autodesk.DesignScript.Geometry.CoEdge.Previous
The previous CoEdge in the containing Loop

Autodesk.DesignScript.Geometry.CoEdge.Next
The next CoEdge in the containing Loop

Autodesk.DesignScript.Geometry.CoEdge.Partner
The neighbouring CoEdge in the reverse direction

Autodesk.DesignScript.Geometry.CoEdge.Edge
The adjacent Edge associated with the CoEdge

Autodesk.DesignScript.Geometry.CoEdge.Loop
The containing Loop to which the CoEdge belongs

Autodesk.DesignScript.Geometry.CoEdge.StartVertex
The Vertex at which this Edge starts

Autodesk.DesignScript.Geometry.CoEdge.EndVertex
The Vertex at which this Edge ends

Autodesk.DesignScript.Geometry.CoEdge.Reversed
The sense of the CoEdge with respect to its Edge

Autodesk.DesignScript.Geometry.CoEdge.ParameterCurve
Curve in parametric space of the owner surface. The curve is in 2D form, thus Z coordinates of this curve are 0.