Autodesk.DesignScript.Geometry.UV.GetHashCode
Get a hashcode for this type
Returns: A unique hashcode for this object

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
Create a UV from two doubles.
u:  U value
v:  V value
Returns:  UV created by coordinates
surfaceparam,parameters,uv,uvs