Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Create a CoordinateSystem with origin at input Point, with X and Y Axes
set as WCS X and Y Axes.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Create a CoordinateSystem at the origin with X and Y axis, with Z
axis ignored completely. Input Vectors are normalized before creating
the CoordinateSystem.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Creates a CoordinateSystem at the specified cylindrical coordinate parameters with respect to the specified coordinate system

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Creates a CoordinateSystem at the specified spherical coordinate parameters with respect to the specified coordinate system

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Determine whether it is possible to get the Inverse of this CoordinateSystem
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Tests if the scaling orthogonal, i.e. does it have a shear component.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Tests if the scaling orthogonal and are all the vectors normalized.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Creates a Point representing the CoordinateSystem origin.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Returns X Axis of CoordinateSystem.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Returns Y Axis of CoordinateSystem.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Returns Z Axis of CoordinateSystem.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Returns the X Axis scaling of the CoordinateSystem: the length of the X Axis vector.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Returns the Y Axis scaling of the CoordinateSystem: the length of the Y Axis vector.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Returns the Z Axis scaling of the CoordinateSystem: the length of the Z Axis vector.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Get the inverse of this CoordinateSystem - applying this CoordinateSystem to a piece of Geometry reverses the original.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Apply the argument CoordinateSystem after this one - Result = this * other

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Apply the argument CoordinateSystem before this one - Result = other * this

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Returns a Vector containing the X, Y, and Z scale factors
Returns: Scaled vector
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Determine if two CoordinateSystems are equal
other: other coordinate system
Returns: returns true if coordinate systems are equal

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Translates any given CoordinateSystem by the given displacements in the x, y,
and z directions defined in WCS respectively.
xTranslation: Displacement along X-axis.
yTranslation: Displacement along Y-axis.
zTranslation: Displacement along Z-axis.
Returns: Transformed CoordinateSystem.
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Translate the object in the direction and magnitude of input Vector.
direction: Vector for translation direction
Returns: Translated coordinate system
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Translates any CoordinateSystem type by the given distance in the given
direction.
direction: Displacement direction vector
distance: Displacement distance along given direction
Returns: Translated coordinate system
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforms this CoordinateSystem from source CoordinateSystem to a new
context CoordinateSystem.
fromCoordinateSystem:
contextCoordinateSystem:
Returns: Transformed CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotates an object around an origin and an axis by a specified degree
origin: Origin point
axis: Vector axis for rotation
degrees: Degrees to rotate
Returns: Rotated coordinate system
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotates an object around the origin and normal of the given Plane by a specified
degree
plane: Plane to get normal from
degrees: Rotation value in degrees
Returns: Rotated coordinate system
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Scale uniformly around the origin
amount: Amount to scale
Returns: Scaled coordinate system
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Scale non-uniformly around the origin
xamount: Amount to scale in X axis
yamount: Amount to scale in y axis
zamount: Amount to scale in z axis
Returns: Scaled coordinate system
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Scale non-uniformly around a given Plane
plane: Plane to scale around
xamount: Amount to scale in X axis
yamount: Amount to scale in y axis
zamount: Amount to scale in z axis
Returns: Scaled coordinate system
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale uniformly around a given point, using
basePoint: Scaling base point
from: Point to scale from
to: Point to scale to
Returns: Scaled coordinate system
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale in one dimension by using a base point, a starting point (from), and an end point (to). The scaling axis is defined by the line between base point and start point.
basePoint: Scaling base point
from: Point to scale from
to: Point to scale to
Returns: Scaled coordinate system
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale in two dimension by base and 2 pick points  The two pick points are projected onto the base plane in order to determine the 2d scale factors
basePlane: Scaling base point
from: Point to scale from
to: Point to scale to
Returns: Scaled coordinate system
resize,size,from,to,scale2d,2d