Autodesk.DesignScript.Geometry.Mesh.ToString
Get a string representation of the Mesh

Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Create a mesh from a collection of Points and a collection of IndexGroups referencing the Point collection
vertexPositions:  List of points that determine vertex positions
indices:  Indices for vertices
Returns:  Mesh created from points
mesh,meshes

Autodesk.DesignScript.Geometry.Mesh.ToJson
Convert the Mesh into a JSON object formatted with dynamo.geometry:mesh-1.0.0 schema.
Returns: The resulting JSON string