Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create an "oriented" T-Spline Plane, positioned at Point origin with Vector normal, but with a specific X-axis orientation.
This has no impact to splitting, intersect, project, etc. operations, it only specifies the orientation of the input CoordinateSystem.
origin: Root point of plane
normal: Normal of plane
xAxis: X-axis of plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a Plane by origin and X, Y axis.
The Z axis is the cross product of the two Vectors.
origin: Root point of plane
xAxis: X-axis of plane
yAxis: Y-axis of plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCylinderRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Construct a T-Spline Cylinder defined by a parent CoordinateSystem, the radius, and the height of the cylinder
cs: Center and base of cylinder will be fit at X-Y plane of this coordinate system
radius: Radius of a cylinder
height: Height of a cylinder
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Cylindric T-Spline Surface
tspline,cylinder,radius,height

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with given base radius at start Point,
extending to an apex at end Point.
startPoint: Start point of a cone
endPoint: End point of a cone
radius: Radius of the base of the cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with axis from start Point to end Point, with given radii at start and end.
This object does not have an apex, and is in the shape of a frustum.
startPoint: Start point of a cone
endPoint: End point of a cone
startRadius: Start radius of a cone
endRadius: End radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with base Point at CoordinateSystem origin, extending in the direction of Z-axis of CoordinateSystem,
with a  circular base in the CoordinateSystem XY Plane.
cs: Center and base of cone will be fit at X-Y plane of this coordinate system
height: Height of a cone
radius: Radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with base Point at CoordinateSystem origin, extending in the direction of CoordinateSystem Z-axis,
with its circular base in the CoordinateSystem XY Plane.
cs: Center and base of will be fit at X-Y plane of this coordinate system
height: Height of a cone
startRadius: Start radius of a cone
endRadius: End radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Sphere containing four input Points on the surface.
points: Four points in list to build a sphere. Points should not be coplanar
radiusSpans: Number of radial spans
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Spherical T-Spline Surface
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Torus with given center and radii, aligned with  default World XY plane
center: Center of a torus
innerRadius: Inner radius of a torus
outerRadius: Outer radius of a torus
innerRadiusSpans: Number of inner radial spans
outerRadiusSpans: Number of outer radial spans
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Toroidal T-Spline Surface
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Box centered at input Point, with specified width, length,  and height.
origin: Center of a box
width: Width of a box
length: Length of a box
height: Height of a box
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Box centered and oriented to input CoordinateSystem, with  specified width, length, and height.
cs: X-Y plane of box will be aligned with corresponding X
width: Width of a box
length: Length of a box
height: Height of a box
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create an T-Spline Box spanning from low Point to high Point.
lowPoint: First corner point
highPoint: Second corner point
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Quadball with center at CoordinateSystem origin  and given radius
cs: Local coordinate system
radius: Quadball radius
spans: Spans number in two dimensions of sides of Quadball
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Quadball
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Quadball with given center and radius, aligned with  default World XY plane
center: Quadball center point
radius: Quadball radius
spans: Spans number in two dimensions of sides of Quadball
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Quadball
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Construct T-Spline surface from NURBS Surface using uniform strategy.
Input NURBS surface is rebuilt with uniform knots placed at equal parametric or
arc length intervals depending on corresponding useArcLen flag, and approximated by
degree 3 NURBS surface. Output T-Spline is divided by given span counts
in u and v directions.
nurbsSurface: Input NURBS surface
uSpans: Required spans number in u direction
vSpans: Required spans number in v direction
uUseArcLen: Whether to use arc length or parametric subdivision in u parametric direction
vUseArcLen: Whether to use arc length or parametric subdivision in v parametric direction
inSmoothMode: Show T-Spline Surface in box or smooth visualization
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Construct a T-Spline by sweeping a cross section Curve along a path.
profile: Profile curve
path: Path curve
parallel: Is spans should be parallel in path directio
pathSpans: Spans number in path
profileSpans: Spans number in profile. Automatically defined if 0 or less
pathUniform: Use uniform or curvature strategy for spans distribution along path
profileUniform: Use uniform or curvature strategy for spans distribution along profile
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Surface by sweeping the profile Curve around the axis formed
by the axis origin and axis direction, starting at start_angle in degrees,
and sweeping by sweep_angle in degrees.
profile: Profile curve
axisOrigin: Rotation center
axisDirection: Rotation axis
startAngle: Angle to start rotation from
sweepAngle: Angle to finish rotation at
radialSpans: Spans number in radius
axialSpans: Spans number in height. Automatically defined if 0 or less
uniform: Use uniform or curvature strategy for spans distribution
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Make a piped surface out of a network of curves or lines.
A smooth joint is created at each curve intersection.
Some parameter take single value or list - two valies per curve.
curves: A list of curves to create pipes from
defaultRadius: Default radius for created pipes
snappingTolerance: The tolerance used to detect curve intersections
segmentsCount: Numbers of segments in each pipe. Single value or list, two times longer than curves count, are allowed
endRotations: Values of end rotations for each pipe (in degrees). Single value or list, two times longer than curves count, are allowed
endRadii: Values of end radiuses for each pipe. Single value or list, two times longer than curves count, are allowed
endPercentage: Values (0 to 1) from the end of each input curve to start of the pipe mesh. Single value or list, two times longer than curves count, are allowed
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Make a piped surface out of a network of curves or lines.
A smooth joint is created at each curve intersection.
Some parameters take single value or list - one value per curve.
curves: A list of curves to create pipes from
defaultRadius: Default radius for created pipes
snappingTolerance: The tolerance used to detect curve intersections
segmentsCount: Numbers of segments for each curve. The size of the list can be the curve count or 1 for replication or 0 for automatic determination.
autoHandleStart: If true, the parameters of the handle at the start of each curve are automatically generated, and the custom parameters of rotationsAtStart, radiiAtStart, and positionsAtStart are ignored.
autoHandleEnd: If true, the parameters of the handle at the end of each curve are automatically generated, and the custom parameters of rotationsAtEnd, radiiAtEnd, and positionsAtEnd are ignored.
startRotations: Custom rotation angle in degrees for each pipe handle at the start of each curve. This parameter is ignored when autoHandleStart is true. The size of the list can be the curve count or 1 for replication.
endRotations: Custom rotation angle in degrees for each pipe handle at the end of each curve. This parameter is ignored when autoHandleEnd is true. The size of the list can be the curve count or 1 for replication.
startRadii: Custom radius for each pipe handle at the start of each curve. This parameter is ignored when autoHandleStart is true. The size of the list can be the curve count or 1 for replication.
endRadii: Custom radius for each pipe handle at the end of each curve. This parameter is ignored when autoHandleEnd is true. The size of the list can be the curve count or 1 for replication.
startPositions: Custom position of each pipe handle at the start of each curve in percentage between 0 and 1 along the arc-length of curve. This parameter is ignored when autoHandleStart is true. The size of the list can be the curve count or 1 for replication. The start and end position should not overlap each other on each curve. Ideally, the start position should be close to 0, while the end position close to 1.
endPositions: Custom position of each pipe handle at the end of each curve in percentage between 0 and 1 along the arc-length of curve. This parameter is ignored when autoHandleEnd is true. The size of the list can be the curve count or 1 for replication. The start and end position should not overlap each other on each curve. Ideally, the start position should be close to 0, while the end position close to 1.
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Whether t-spline in box or smooth mode
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Whether t-spline is is open.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Convert TSpline surface to Solid or Surface depending on shape.
Note: There could be subtle unexpected changes in the resulting B-Rep if the input surface is created in a higher T-Splines version than the version loaded in Dynamo as in this case a copy of the surface will be downgraded to the Dynamo version and used in the conversion.
matchTopology: Determines if the resulting body should have the same topology as the input TSpline surface.
Returns: Topology entity (Solid or Surface)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Convert t-spline surface to mesh. Mesh can have both triangles and quads.
minSegments: The minimum number of segments in each direction. At least one segment will always be produced.
tolerance: Maximum allowed distance from the mesh to the surface. Setting to a zero or a negative value will disable its use
Returns: Mesh entity
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Weld given list of vertices into a single vertex.
vertices: Vertices to weld
newPosition: Position of the result vertex grip. Mean position of grips is used if null is passed.
keepSubdCreases: Preserve the subd-creases of the input topology
Returns: TSpline surface with welded vertices
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Create match with T-Spline and closed loop of curves
tsEdges: Closed T-Spline edge loop to create match with
curves: Closed curve loop to create match with
continuity: Geometry continuity to attempt to match: G0, G1, G2
useArclength: Wether to use arcLength alignment while building match
useRefinement: If true, extra control points will be added to the T-spline to match the surfaces within a given tole­rance.
numRefinementSteps: Max number of refinement steps. Ignored if useRefinement is set to false
refinementTolerance: Tolerance to hit. Ignored if useRefinement is set to false
usePropagation: Whether to use propagation while building match
widthOfPropagation: Determines how much of the surface is affected by the match. Ignored if usePropagation is set to false
tangentScale: Tangent scale. If continuity is not set to G1 is ignored
curvParamWeight: Carvature param weight. If continuity is not set to G2 is ignored
flipSourceTargetAlignment: Whether to reverse the alignment direction
Returns: T-Spline surface positioned between given T-Spline border edges and curve loop
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Create match with T-Spline and closed loop of curves
tsEdges: Closed T-Spline edge loop to create match with
curves: Closed curve loop to create match with
continuity: Geometry continuity to attempt to match: G0, G1, G2
useArclength: Wether to use arcLength alignment while building match
useRefinement: If true, extra control points will be added to the T-spline to match the surfaces within a given tole­rance.
numRefinementSteps: Max number of refinement steps. Ignored if useRefinement is set to false
refinementTolerance: Tolerance to hit. Ignored if useRefinement is set to false
usePropagation: Whether to use propagation while building match
widthOfPropagation: Determines how much of the surface is affected by the match. Ignored if usePropagation is set to false
scale: Tangent scale for G1 or curvature scale for G2. Ignored if continuity is G0.
flipSourceTargetAlignment: Whether to reverse the alignment direction
Returns: T-Spline surface positioned between given T-Spline border edges and curve loop
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Create match with T-Spline and closed loop of BRep edges. First,
edge loop is converted to curve loop and then match is performed
tsEdges: Closed T-Spline edge loop to create match with
brepEdges: Closed BRep edge loop to create match with
continuity: Geometry continuity to attempt to match: G0, G1, G2
useArclength: Wether to use arcLength alignment while building match
useRefinement: If true, extra control points will be added to the T-spline to match the surfaces within a given tole­rance.
numRefinementSteps: Max number of refinement steps. Ignored if useRefinement is set to false
refinementTolerance: Tolerance to hit. Ignored if useRefinement is set to false
usePropagation: Whether to use propagation while building match
widthOfPropagation: Determines how much of the surface is affected by the match. Ignored if usePropagation is set to false
tangentScale: Tangent scale. If continuity is not set to G1 is ignored
curvParamWeight: Carvature param weight. If continuity is not set to G2 is ignored
flipSourceTargetAlignment: Whether to reverse the alignment direction
Returns: T-Spline surface positioned between given T-Spline border edges and BRep edge loop
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Build bridge between two sets of faces. Items of the first group
are considered as children of this surface. Items of the second
group can be either children of this surface or belong to
a different surface. Topology within each group might not be adjacent,
but should create the same count of distinct loops.
firstGroup: First group of faces to bridge
secondGroup: Second group of faces to bridge
followCurves: Bridging curves for each distinct topology
loop (straight lines are used if empty list is passed, if one curve
passed it is replicated if more than one input loop is detected)
frameRotations: Number of full rotations around
the normal of the frames along the bridging curve for each distinct
loop of topology (0 is used if empty list is passed, if one value
passed it is replicated if more than one input loop is detected)
spansCounts: Number os segments along the bridge for
each distinct topology loop. Span count for each group should be
greater than corresponding number of rotations (1 is used if empty
list is passed, if one value passed it is replicated if more than
one input loop is detected)
cleanBorderBridges: Delete bridges between border edges.
keepSubdCreases: Preserve the subd-creases of the
input topology
firstAlignVertices: List of orient vertices for
each distinct topology loop from the first group (The number of vertices should
be the same as detected input loops or list can be empty)
secondAlignVertices: List of orient vertices for
each distinct topology loop from the second group (The number of vertices should
be the same as detected input loops or list can be empty)
flipAlignmentFlags: List of flags indicating whether
to flip alignment of bridge for corresponding topology loop.
(false is set if empty list is passed, if one value passed it is replicated
for each detected input loop)
Returns: TSpline surface with topology, connected by bridge
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Build bridge between set of faces and set of edges. Items of the
first group are considered as children of this surface. Items of
the second group can be either children of this surface or belong
to a different surface. Topology within each group might not be
adjacent, but should create the same count of distinct loops.
firstGroup: First group of faces to bridge
secondGroup: Second group of edges to bridge
followCurves: Bridging curves for each distinct topology
loop (straight lines are used if empty list is passed, if one curve
passed it is replicated if more than one input loop is detected)
frameRotations: Number of full rotations around
the normal of the frames along the bridging curve for each distinct
loop of topology (0 is used if empty list is passed, if one value
passed it is replicated if more than one input loop is detected)
spansCounts: Number os segments along the bridge for
each distinct topology loop. Span count for each group should be
greater than corresponding number of rotations (1 is used if empty
list is passed, if one value passed it is replicated if more than
one input loop is detected)
cleanBorderBridges: Delete bridges between border edges.
keepSubdCreases: Preserve the subd-creases of the
input topology
firstAlignVertices: List of orient vertices for
each distinct topology loop from the first group (The number of vertices should
be the same as detected input loops or list can be empty)
secondAlignVertices: List of orient vertices for
each distinct topology loop from the second group (The number of vertices should
be the same as detected input loops or list can be empty)
flipAlignmentFlags: List of flags indicating whether
to flip alignment of bridge for corresponding topology loop.
(false is set if empty list is passed, if one value passed it is replicated
for each detected input loop)
Returns: TSpline surface with topology, connected by bridge
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Build bridge between set of edges and set of faces. Items of the
first group are considered as children of this surface. Items of
the second group can be either children of this surface or belong
to a different surface. Topology within each group might not be
adjacent, but should create the same count of distinct loops.
firstGroup: First group of edges to bridge
secondGroup: Second group of faces to bridge
followCurves: Bridging curves for each distinct topology
loop (straight lines are used if empty list is passed, if one curve
passed it is replicated if more than one input loop is detected)
frameRotations: Number of full rotations around
the normal of the frames along the bridging curve for each distinct
loop of topology (0 is used if empty list is passed, if one value
passed it is replicated if more than one input loop is detected)
spansCounts: Number os segments along the bridge for
each distinct topology loop. Span count for each group should be
greater than corresponding number of rotations (1 is used if empty
list is passed, if one value passed it is replicated if more than
one input loop is detected)
cleanBorderBridges: Delete bridges between border edges.
keepSubdCreases: Preserve the subd-creases of the
input topology
firstAlignVertices: List of orient vertices for
each distinct topology loop from the first group (The number of vertices should
be the same as detected input loops or list can be empty)
secondAlignVertices: List of orient vertices for
each distinct topology loop from the second group (The number of vertices should
be the same as detected input loops or list can be empty)
flipAlignmentFlags: List of flags indicating whether
to flip alignment of bridge for corresponding topology loop.
(false is set if empty list is passed, if one value passed it is replicated
for each detected input loop)
Returns: TSpline surface with topology, connected by bridge
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Build bridge between two sets of edges. Items of the
first group are considered as children of this surface. Items of
the second group can either be children of this surface or belong
to a different surface. Topology within each group might not be
adjacent but should create the same count of distinct loops.
firstGroup: First group of edges to bridge
secondGroup: Second group of edges to bridge
followCurves: Bridging curves for each distinct topology
loop (straight lines are used if empty list is passed, if one curve
passed it is replicated if more than one input loop is detected)
frameRotations: Number of full rotations around
the normal of the frames along the bridging curve for each distinct
loop of topology (0 is used if empty list is passed, if one value
passed it is replicated if more than one input loop is detected)
spansCounts: Number os segments along the bridge for
each distinct topology loop. Span count for each group should be
greater than corresponding number of rotations (1 is used if empty
list is passed, if one value passed it is replicated if more than
one input loop is detected)
cleanBorderBridges: Delete bridges between border edges.
keepSubdCreases: Preserve the subd-creases of the
input topology
firstAlignVertices: List of orient vertices for
each distinct topology loop from the first group (The number of vertices should
be the same as detected input loops or list can be empty)
secondAlignVertices: List of orient vertices for
each distinct topology loop from the second group (The number of vertices should
be the same as detected input loops or list can be empty)
flipAlignmentFlags: List of flags indicating whether
to flip alignment of bridge for corresponding topology loop.
(false is set if empty list is passed, if one value passed it is replicated
for each detected input loop)
Returns: TSpline surface with topology, connected by bridge
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Fill holes in a T-spline
edges: Set of edges with hole inside. Edges must be border.
fillMethod: Method for filling hole: 0 - tesselation, 1 - ngons, 2 - collapse, 3 - collapse and weld
keepSubdCreases: Preserve the subd-creases of the input topology
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Compress all topology on the surface and make the indices contiguous. This function maintains the relative order of the indices.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
Forward interpolation moves control points to their parametric locations on the surface. Reverse interpolation generates a point on the surface for each original control point and moves this control point to its corresponding surface point.
reverse: Interpolation direction: forward if false, reverse otherwise
Returns: Interpolated T-Spline in given direction
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Flatten control points of given vertices to a single plane.
This command requires an input of at least four vertices
vertices: List of vertices
Returns: T-SPline Surface with flattened vertices
tspline,flatten,vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Plane)
Flatten control points of given vertices to a single plane
which will be parallel with the given plane.
This command requires an input of at least four vertices
vertices: List of vertices
parallelPlane: Plane to fit vertices parallel to
Returns: T-SPline Surface with flattened vertices
tspline,flatten,vertices,fitparallel

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Copy chosen faces to the new surface. New surface has no symmetry
faces: Faces to duplicate
Returns: T-Spline Surface with chosen faces only
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Move given vertices along given vector
vertices: Vertex list to be moved
vector: Direction to move along
onSurface: Flag, indicating whether to use surface or control points of vertices
Returns:

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Export given set of T-Spline surfaces to T-Spline Scene file
tSplineSurfaces: Set of a T-Spline surfaces to export
filePath: Path to file to save to
Returns: File path where T-Spline set is being saved
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Export given T-Spline surface to T-Spline Mesh file
tSplineSurface: T-Spline surface to export
filePath: Path to file to save to
Returns: File path where T-Spline Surface is being saved
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Write T-Spline Surface into a string in T-Spline Mesh format.
tSplineSurface: T-Spline surface to serialize
Returns: String where T-Spline Surface is being serialized
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Create a T-Spline Surface from the string in T-Spline Mesh format.
content: String representation of T-Spline Mesh file
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Newly loaded T-Spline surface in list
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Load a T-Spline Surface from given T-Spline Mesh file
filePath: Path to file to load from
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Newly loaded T-Spline surface in list
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Load a T-Spline Surface from given T-Spline Mesh file
file: File to load from
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Newly loaded T-Spline surface in list
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Load set of a T-Spline surfaces from given T-Spline Scene file
filePath: Path to file to load from
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: A set of newly loaded T-Spline Surfaces
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Load set of a T-Spline surfaces from given T-Spline Scene file
file: File to load from
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: A set of newly loaded T-Spline Surfaces
tspline,import,load,tss,file