Autodesk.DesignScript.Geometry.TSpline.TSplineFace.Edges
All of the TSplineEdges around this Face in counterclockwise order

Autodesk.DesignScript.Geometry.TSpline.TSplineFace.Vertices
All of the TSplineVertices around this Face in counterclockwise order

Autodesk.DesignScript.Geometry.TSpline.TSplineFace.Info
A bunch of TSplineFace properties: uvnFrame, index, valence and number of sides
Returns: