Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Get a hashcode for this type
Returns: A unique hashcode for this object

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Form a Vector by 3 Euclidean coordinates
x:  X coordinate
y:  Y coordinate
z:  Z coordinate
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Form a Vector by 3 Euclidean coordinates and normalize the Vector
x:  X coordinate
y:  Y coordinate
z:  Z coordinate
normalized: True to normalize vector, false to not normalize
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Form a Vector by two end points.  The result is a vector from the start to the end point.
start:
end:
Returns:
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Get the canonical X axis Vector (1,0,0)
Returns:
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Get the canonical Y axis Vector (0,1,0)
Returns:
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Get the canonical Z axis Vector (0,0,1)
Returns:
z,basis,up

Autodesk.DesignScript.Geometry.Vector.AsPoint
Get the Point with the same X, Y, and Z component
Returns:
convertopoint,vector2point

Autodesk.DesignScript.Geometry.Vector.Reverse
Get the reverse of the vector.  Essentially this negates the X, Y, and Z components of the Vector.
Returns:
backwards,vectorflip

Autodesk.DesignScript.Geometry.Vector.Add(Autodesk.DesignScript.Geometry.Vector)
Add a vector
vectorToAdd:
Returns:
sum,sumvectors

Autodesk.DesignScript.Geometry.Vector.Subtract(Autodesk.DesignScript.Geometry.Vector)
Subtract a vector
vectorToSubtract:
Returns:
substact,diff vectors,between

Autodesk.DesignScript.Geometry.Vector.Cross(Autodesk.DesignScript.Geometry.Vector)
Form the cross product of two vectors
cross:
Returns:
perpendicular

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Form the dot product of two vectors
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.Normalized
Get the normalized version of a vector
Returns:

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Determine whether two vectors are parallel.
otherVector: Other vector
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Determine whether two vectors are almost equal. A tolerance value of 1e-5 given to handle precision issues.
otherVector: Other vector
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transform this Vector by input CoordinateSystem matrix.
coordinateSystem: Coordinate system used to transform vector
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotates a Vector around an axis by a specified number of degrees
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotates a vector around the Plane origin and normal by a specified  degree
plane: Rotation plane
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Scale Vector uniformly around the origin
scale_factor:  Scale factor
Returns:  Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double,System.Double,System.Double)
Scale Vector non-uniformly around the origin
xScaleFactor:
yScaleFactor:
zScaleFactor:
Returns:
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
Returns the angle between the two Vectors, in the range [0, 180] degrees.
otherVector:
Returns:
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Returns the angle between the two vectors in degrees from 0 to 360. It uses axis of rotation to determine the direction of the angle.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Returns the angle between the two Vectors, in the range [0, 360] degrees. It uses axis of rotation to determine the direction of the angle.
otherVector:
rotationAxis:
Returns:
rotation angle