Autodesk.DesignScript.Geometry.PolySurface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Makes PolySurface by Loft through Curves.
crossSections:  Curves to loft through.
Returns:

Autodesk.DesignScript.Geometry.PolySurface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Makes PolySurface by Loft through PolyCurves.
crossSections:  Curves to loft through.
guideCurve:  Curve to guide loft through.
Returns:
loftbyrail

Autodesk.DesignScript.Geometry.PolySurface.ByLoftGuides(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Makes PolySurface by Loft through PolyCurves.
crossSections:  Curves to loft through.
guideCurves:  Curves to guide loft through.
Returns:
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.PolySurface.ByJoinedSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Make Polysurface by joining surfaces.
surfaces:  Surfaces to join into polysurface
Returns:
joinsurfaces,joinsrf

Autodesk.DesignScript.Geometry.PolySurface.BySolid(Autodesk.DesignScript.Geometry.Solid)
Make Polysurface by surfaces of Solid.
solid:  Solid which surfaces to use
Returns:
solid2poly,solidtopoly,convertsolid

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Make Polysurface by sweeping curves along rail.
rail:  Curve to sweep along
crossSection:  Sweep profile
Returns:
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Make Polysurface by sweeping a curve along rail.
rail:  Curve to sweep along
profile:  Sweep profile
Returns:
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.Surfaces
Return new Surfaces representing the underlying Surfaces.
Returns:
subsurfaces,getsurfaces,explode

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Locate Surfaces by point. Takes first intersection in forward direction.  Returns one surface if hit  surface interior, two if hit edge interior, and many if hit vertex
point:
direction:
Returns:
surfacesatpoint,findsurfaces,extractsurfaces

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByLine(Autodesk.DesignScript.Geometry.Line)
Locate Surfaces by Line. Takes all surfaces hit by line.
line:
Returns:
surfacesonline,findsurfaces,extractsurfaces,lines
0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolySurface.UnconnectedBoundaries
Compute 2d cell boundaries which are not connected to other Surfaces
Returns:

Autodesk.DesignScript.Geometry.PolySurface.ExtractSolids
Extract Solids from Polysurface defined by subset of surfaces
Returns:

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Returns number of surfaces of polysurface.
Returns:  Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
Returns number of edges of polysurface.
Returns:  Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
Returns number of vertices of polysurface.
Returns:  Number of vertices

Autodesk.DesignScript.Geometry.PolySurface.Fillet(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Double)
Fillets a PolySurface along input Edges with a given radius.
edges:
radius:
Returns:
round,smooth,smoothedge,roundedges

Autodesk.DesignScript.Geometry.PolySurface.Chamfer(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Double)
Chamfers a PolySurface along input Edges with a given offset from the edge corner.
edges:
offset:
Returns:
bevel,flattenedges